---
kind: property
id: P:Autodesk.Revit.DB.Revolution.StartAngle
source: html/828fbef8-3522-5913-1d6d-722cfa9e7a93.htm
---
# Autodesk.Revit.DB.Revolution.StartAngle Property

The start angle of the revolution relative to the sketch plane.

## Syntax (C#)
```csharp
public double StartAngle { get; set; }
```

## Remarks
The direction of the angle is based on the normal of the sketch plane.
A positive angle is on the same side as the normal, a negative angle on the opposite side.